/* // See https://aka.ms/new-console-template for more information
Console.WriteLine("Hello, World!");
*/


/*
Задача 15: Напишите программу, которая принимает на вход цифру, обозначающую день недели, и проверяет, является ли этот день выходным.
6 -> да
7 -> да
1 -> нет
*/




